// ЗАДАЧА 1

// https://www.codewars.com/kata/576757b1df89ecf5bd00073b

// Найти пропущенную букву
// Напишите метод, который принимает массив из букв английского алфамита (расположенных последовательно, 'по возрастанию')
// и возвращает пропущенную букву.

// Длина массива всегда будет не менее 2.
// Массив всегда будет содержать буквы только одного регистра.

// Example:
// ['a','b','c','d','f'] -> 'e'
// ['O','Q','R','S'] -> 'P'

// ЗАДАЧА 2

// https://www.codewars.com/kata/5839edaa6754d6fec10000a2

// Построить башню-пирамиду в виде массива/списка строк на основе заданного положительного целого числа этажей.
// Каждый этаж башни представлен символом "*".
// т.е функция принимает целое положительное число, а возвращает массив из строк как в примере ниже

// башня из 3 этажей

// [
//   "  *  ",
//   " *** ",
//   "*****"
// ]

// башня из 6 этажей:

// [
//   "     *     ",
//   "    ***    ",
//   "   *****   ",
//   "  *******  ",
//   " ********* ",
//   "***********"
// ]

// ЗАДАЧА 3

// https://www.codewars.com/kata/57eb8fcdf670e99d9b000272

// Напишите функцию, которая принимает строку слов, а возвращает слово с наибольшим количеством
// Каждая буква слова оценивается определенным количеством баллов, соответствующим ее позиции в алфавите: a = 1, b = 2, c = 3 и т. д.
// Например, слово abad имеет балл 8 (1 + 2 + 1 + 4).
// Необходимо вернуть слово с наибольшим баллом в виде строки.
// Если два слова набирают одинаковое количество баллов, верните слово, которое появляется раньше в исходной строке.
// Все буквы будут в нижнем регистре, а все входные данные будут допустимыми.
